Repo/Sample_stacking/8_5sample_stacking/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5000
(
3.33013333e-05
3.33013333e-05
3.33013333e-05
3.33013333e-05
3.33013333e-05
3.33013333e-05
3.33013333e-05
3.33013333e-05
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
5000
(
4.9952e-05
4.9952e-05
4.9952e-05
4.9952e-05
4.9952e-05
4.9952e-05
4.9952e-05
4.9952e-05
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 3.33013333e-05;
    }
    outlet
    {
        type            calculated;
        value           uniform 3.33013333e-05;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
